In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [5]:
# Persiapan Data Frame

In [11]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  5  7  7  4  8
1  1  3  7  4  9
2  5  5  1  9  4
3  7  4  5  8  6
4  9  6  6  5  8

In [16]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [ ]:
# Menyertakan Prefix Kolom

In [17]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        5        7        7        4        8
1        1        3        7        4        9
2        5        5        1        9        4
3        7        4        5        8        6
4        9        6        6        5        8

In [18]:
# Menyertakan Suffix Kolom

In [19]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        5        7        7        4        8
1        1        3        7        4        9
2        5        5        1        9        4
3        7        4        5        8        6
4        9        6        6        5        8

In [20]:
# Persiapan Data Frame

In [22]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  1  3  4  4  2
1  3  4  3  1  2
2  4  2  4  4  2
3  3  4  1  2  3
4  4  1  2  1  2
5  3  3  3  3  1
6  1  1  1  4  1
7  4  2  1  3  1
8  2  2  2  2  2
9  1  2  2  4  2

In [ ]:
# Selection dengan operator logika |

In [23]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  1  3  4  4  2
1  3  4  3  1  2
3  3  4  1  2  3
5  3  3  3  3  1
6  1  1  1  4  1
9  1  2  2  4  2

In [24]:
# Selection dengan fungsi isin()

In [27]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
0  1  3  4  4  2
1  3  4  3  1  2
3  3  4  1  2  3
5  3  3  3  3  1
6  1  1  1  4  1
9  1  2  2  4  2

In [28]:
# Mengenal operasi negasi ~

In [29]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
2  4  2  4  4  2
4  4  1  2  1  2
7  4  2  1  3  1
8  2  2  2  2  2

In [30]:
# Persiapan Data Frames

In [31]:
data = {'col1':['1', '2', '3', 'teks'],
        'col2': ['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [32]:
df.dtypes

col1    object
col2    object
dtype: object

In [33]:
# Konversi tipe data dengan fungsi astype()

In [34]:
df_x = df.astype({'col2' : 'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [35]:
df_x.dtypes

col1    object
col2     int32
dtype: object

In [36]:
# Konversi tipe data numerik dengan fungsi tp_numeric()

In [37]:
df.apply(pd.to_numeric, errors = 'coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [38]:
# Persiapan Data Frame

In [42]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns = cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq = 'H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         19.0         18    A
1 2000-01-01 01:00:00         13.0         17    B
2 2000-01-01 02:00:00         16.0          1    C
3 2000-01-01 03:00:00         11.0         12    D
4 2000-01-01 04:00:00         15.0          7    E

In [41]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [ ]:
# Memilih kolom bertipe data numerik

In [43]:
df.select_dtypes(include = 'number')

   bil_pecahan  bil_bulat
0         19.0         18
1         13.0         17
2         16.0          1
3         11.0         12
4         15.0          7

In [44]:
df.select_dtypes(include = 'float')

   bil_pecahan
0         19.0
1         13.0
2         16.0
3         11.0
4         15.0

In [45]:
df.select_dtypes(include = 'int')

   bil_bulat
0         18
1         17
2          1
3         12
4          7

In [46]:
# Memilih kolom dengan kombinasi tipe data

In [47]:
df.select_dtypes(include = ['number', 'object'])

   bil_pecahan  bil_bulat teks
0         19.0         18    A
1         13.0         17    B
2         16.0          1    C
3         11.0         12    D
4         15.0          7    E